nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot-v2.c
/*
 *
 *    Copyright (c) 2018 Nest Labs, Inc.
 *    All rights reserved.
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */
/*
 *    Description:
 *       This is an nlradio abstraction layer for the Nordic OpenThread
 *       radio driver.
 */

#include <stdlib.h>
#include <string.h>

#include <nlassert.h>
#include <nlutilities.h>
#include <nlsysenv.h>
#include <nlopenthread.h>
#include <nlplatform.h>
#include <nlplatform/nlradio.h>
#include <nlplatform/nltime.h>
#include <nlplatform/nltimer.h>
#if defined(BUILD_FEATURE_NL_PROFILE)
#include <nlplatform/nlprofile.h>
#endif

#include <nrf_802154.h>
#include <nrf_802154_const.h>
#include <nrf_802154_critical_section.h>
#include <nrf_802154_core.h>

/**
 **************************
 * Local Symbols and Types
 **************************
 */

#ifdef NLRADIO_DEFAULT_NUM_RX_BUFFERS
#define NLRADIO_NUM_RX_BUFFERS          (NLRADIO_DEFAULT_NUM_RX_BUFFERS)
#else
#define NLRADIO_NUM_RX_BUFFERS          (4)
#endif

#define NLRADIO_SLEEP_WAIT_MS           (20)
#define NLRADIO_TX_WAIT_MS              (10)
#define NLRADIO_ESCAN_WAIT_MS           (10)

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
#define NLRADIO_MAX_RADIO_TX_POWER      (RADIO_TXPOWER_TXPOWER_0dBm)
#else
#define NLRADIO_MAX_RADIO_TX_POWER      (RADIO_TXPOWER_TXPOWER_Pos8dBm)
#endif

#define NLRADIO_RECEIVE_SENSITIVITY     (-100)   // dBm

#if defined(BUILD_FEATURE_ANTENNA_DIVERSITY)
// Indicates the number of bits we use to save the history
#define NL_RADIO_NUM_BITS                   ((sizeof(s_tx_failure_ota))*8)
// Switch antenna if we see more than 50% failures
#define NL_RADIO_FAILURE_THRESH             ((NL_RADIO_NUM_BITS)/2)
// Invalid or unknown RSSI value
#define NLRADIO_INVALID_RSSI                (127)
// Precision multiple for RSS average (1 << NLRADIO_PRECISON_BIT_SHIFT)
#define NLRADIO_RSSI_PRECISON_SHIFT         (3)
#define NLRADIO_PRECISON                    (1 << NLRADIO_RSSI_PRECISON_SHIFT)
#define NLRADIO_INVALID_RSSI_PRECISON_SHIFT (NLRADIO_INVALID_RSSI << NLRADIO_RSSI_PRECISON_SHIFT)
#define NLRADIO_RSSI_PRECISON_MASK          (NLRADIO_PRECISON - 1)
// Coefficient used for exponentially weighted filter (1 << NLRADIO_RSSI_COEFF_SHIFT)
#define NLRADIO_RSSI_COEFF_SHIFT            (3)
#endif

/**
 ****************************
 * Typedefs and Prototypes
 ****************************
 */

/**
 * This structure contains an IEEE 802.15.4 radio frame data.
 */
typedef struct nlradio_packet_s
{
    uint8_t                            length;                  ///< Length of the PSDU.
    uint8_t                            psdu[MAX_PACKET_SIZE];   ///< The PSDU.
    uint8_t                            channel;                 ///< Channel used to transmit/receive the frame.
    int8_t                             power;                   ///< Transmit/receive power in dBm.
    uint8_t                            lqi;                     ///< Link Quality Indicator for received frames.
    volatile bool                      in_use;                  ///< packet is in use
    volatile struct nl_radio_packet_s *next;                    ///< next pointer used for RX packets
#ifdef BUILD_FEATURE_RADIO_HEADER_IE
    uint64_t                           timestamp;               ///< The timestamp in microseconds when the frame was start to receive (rx sfd).
#endif
} nlradio_packet_t;

#ifdef BUILD_FEATURE_ANTENNA_DIVERSITY
/**
 * Internal data structure contains per antenna transmission statistics counters.
 */
typedef struct nlradio_per_ant_stats_internal
{
    uint32_t tx_success_cnt;
    uint32_t tx_fail_cnt;
} nlradio_per_ant_stats_internal_t;

/**
 * Internal data structure to store per antenna tx stats & precison shifted ack rssi average.
 */
typedef struct nlradio_ant_stats_internal
{
    nlradio_per_ant_stats_internal_t antenna_stats[ANTENNA_MAX];
    int16_t                          shifted_avg_ack_rssi[ANTENNA_MAX];
    uint32_t                         ant_switch_cnt;
} nlradio_ant_stats_internal_t;
#endif

static void check_single_task(void);
static void nlradio_rx_packet_init(void);
static nlradio_packet_t *nlradio_rx_packet_alloc_isr(bool *all_used);
static bool nlradio_rx_packet_free(uint8_t *buffer);
static void nlradio_rx_packet_list_enqueue_isr(nlradio_packet_t *packet);
static nlradio_packet_t *nlradio_rx_packet_list_dequeue(void);
static void nlradio_init_internal(void);
static void nlradio_sleep_internal(void);
static void nlradio_wakeup_internal(void);

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
static void nlradio_set_transmit_power(void);
static void nlradio_set_channel_internal(uint8_t channel);
#else
static void nlradio_set_tx_power_internal(int8_t power);
#endif // BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM

#ifdef BUILD_FEATURE_ANTENNA_DIVERSITY
static void nlradio_update_avg_ack_rssi(int8_t rssi);
#endif

/**
 ****************************
 * Static control structures
 ****************************
 */

/**
 * Intermediate nlradio buffers
 */
static nlradio_packet_t s_tx_packet;
static nlradio_packet_t s_rx_packet_pool[NLRADIO_NUM_RX_BUFFERS];
static volatile nlradio_packet_t *s_rx_packet_list_head;
static volatile nlradio_packet_t *s_rx_packet_list_tail;

/**
 * Tracks the state of the radio driver.
 */
static volatile nlradio_state_t s_radio_state = k_nlradio_state_disabled;

/**
 * A transmit callback to be called when the requested TX operation completes.
 */
static volatile transmit_complete_cb s_tx_complete_callback = NULL;

#ifdef BUILD_FEATURE_RADIO_HEADER_IE
/**
 * A transmit callback to be called when the requested TX operation starts (tx sfd).
 */
static volatile transmit_start_cb s_tx_start_callback = NULL;
#endif

/**
 * A receive callback to be called when the requested RX operation completes.
 */
static volatile receive_complete_cb s_rx_callback = NULL;

/**
 * A callback to be called when energy scan completes
 */
static volatile escan_complete_cb s_escan_callback = NULL;

/**
 * State of the radio before starting an energy scan
 */
static nlradio_state_t s_pre_escan_radio_state = k_nlradio_state_disabled;

/**
 * Tracks the channel that was used to configure the radio for receive.
 */
static volatile uint8_t s_channel = 0;

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
/**
 * Target Tx power for a channel in units of 0.01 dBm
 */
static int s_target_txpower = 0;

/**
 * Tx Power backoff for a channel in units of 0.01 dBm
 */
static int s_backoff_txpower = 0;

