nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot-v2.c
/*
 * current product level tx power value, updated during a channel change &
 * target/offset power set operation.
 */
static nlencoded_transmit_power_t s_txpower_settings = INVALID_ENCODED_TXPOWER;
#else
/**
 * Encoded transmit power for ACK frames
 */
static int8_t s_default_tx_power;
#endif //BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM

/**
 * Tracks whether the nrf_802154_received_raw() call has been
 * made from ISR context
 */
static bool s_in_radio_isr = false;

/**
 * Track the thread that is using nlradio.
 * It's used to ensure that only one thread calls nlradio API.
 */
#ifdef NLRADIO_DEBUG
static xTaskHandle s_task = NULL;
#endif /* DEBUG */

#ifdef BUILD_FEATURE_ANTENNA_DIVERSITY
/*
 * Bits of this integer is used to keep track of
 * rolling success and failure of each TX packet.
 */
static uint32_t s_tx_failure_ota = 0;

/*
 * Bit index for the above integer
 */
static uint32_t s_tx_failure_ota_index = 0;

/*
 * Boolean to track whether antenna switching is enabled or not
 */
static bool s_prevent_antenna_switch = false;

/*
 * Data structure to hold the antenna stats.
 * Volatile type qualifier is used since this data structure is updated
 * in the radio ISR context & read from a thread context.
 */
static volatile nlradio_ant_stats_internal_t s_antenna_stats;
#endif

/**
 * This function ensures that only one task is calling nlradio API.
 * nlradio is not thread-safe and requires this check.
 */
static void check_single_task(void)
{
#ifdef NLRADIO_DEBUG
    /* Start tracking the task, which uses nlradio API */
    if (s_task == NULL)
    {
        s_task = xTaskGetCurrentTaskHandle();
    }

    assert(s_task == xTaskGetCurrentTaskHandle());
#endif /* DEBUG */
}

/**
 * Intialize the rx packet pool
 *
 * @note
 *    This function should only be called
 *    when RX interrupts are disabled.
 */
static void nlradio_rx_packet_init(void)
{
    s_rx_packet_list_head = s_rx_packet_list_tail = NULL;

    for (size_t i = 0; i < NLRADIO_NUM_RX_BUFFERS; i++)
    {
        s_rx_packet_pool[i].in_use = false;
    }
}

/**
 * Allocate a rx packet from the rx packet pool
 *
 * @note
 *    This functions is called from the RX ISR.
 *    So, this alloc function will always
 *    operate atomically with respect to the
 *    free function.
 *
 * @param[out] all_used    A pointer to a boolean variable.
 *     The value will be set to indicate whether all rx
 *     packets are in-use (after allocating the rx packet).
 *     This could be used to decide whether to disable
 *     auto-ack.
 *
 * @retval pointer to a rx packet if one is available
 * @retval NULL if a rx packet is unavailable
 */
static nlradio_packet_t *nlradio_rx_packet_alloc_isr(bool *all_used)
{
    nlradio_packet_t *p = NULL;

    *all_used = true;

    for (size_t i = 0; i < NLRADIO_NUM_RX_BUFFERS; i++)
    {
        if (!p)
        {
            if (!s_rx_packet_pool[i].in_use)
            {
                s_rx_packet_pool[i].in_use = true;
                s_rx_packet_pool[i].next = NULL;
                p = &s_rx_packet_pool[i];
            }
        }
        else
        {
            /* After allocating a rx packet (`p` being non-NULL), check
             * if we can still find another free buffer from the pool.
             * If we can, set `all_used` to false and return.
             */

            if (!s_rx_packet_pool[i].in_use)
            {
                *all_used = false;
                break;
            }
        }
    }

    return p;
}

/**
 * Free a rx packet to the rx packet pool
 *
 * @note
 *    This functions is called from the nlradio API.
 *
 * @param[in] buffer  a pointer to the psdu member of a rx packet
 *
 * @retval true if packet was freed
 * @retval false if packet was not freed
 */
static bool nlradio_rx_packet_free(uint8_t *buffer)
{
    bool result = false;

    for (size_t i = 0; i < NLRADIO_NUM_RX_BUFFERS; i++)
    {
        if (buffer == s_rx_packet_pool[i].psdu)
        {
            /* As the rx packet buffer is being freed (`in_use` set to
             * `false`) the auto-ack should be enabled (in case it
             * was disabled from the receive ISR earlier). These two
             * operations should be done atomically to ensure that the
             * freed buffer cannot be claimed by the rx ISR callback
             * before we get the chance to enable the auto-ack. So
             * they are protected by disabling/enabling interrupts.
             */

            nrf_802154_critical_section_enter();

            s_rx_packet_pool[i].next = NULL;
            s_rx_packet_pool[i].in_use = false;

            if (!nrf_802154_auto_ack_get())
            {
                nrf_802154_auto_ack_set(true);
            }

            nrf_802154_critical_section_exit();

            result = true;
            break;
        }
    }

    return result;
}

/**
 * Enqueue a rx packet to the received packet list.
 *
 * @note
 *    This functions is called from the RX ISR.
 *    So, it operates atomically with respect to
 *    the dequeue function.  If this function is
 *    not called from inside of the RX ISR there
 *    could potentially be a race condition with
 *    respect to the management of the list head
 *    and tail pointers.
 *
 * @param[in] packet  a pointer to a rx packet
 */
static void nlradio_rx_packet_list_enqueue_isr(nlradio_packet_t *packet)
{
    packet->next = NULL;

    if (s_rx_packet_list_tail == NULL)
    {
        s_rx_packet_list_tail = s_rx_packet_list_head = packet;
    }
    else
    {
        s_rx_packet_list_tail->next = (volatile struct nl_radio_packet_s *)packet;
        s_rx_packet_list_tail = packet;
    }
}

/**
 * Dequeue a rx packet from the received packet list.
 *
 * @note
 *    This functions is called from the nlradio API
 *    So, the RX interrupt must be disabled
 *    when managing the list head and tail pointers.
 *
 * @param[in] packet  a pointer to a rx packet
 *
 * @retval pointer to a rx packet if one is available
 * @retval NULL if a rx packet is unavailable
 */
static nlradio_packet_t *nlradio_rx_packet_list_dequeue(void)
{
    nlradio_packet_t *p = NULL;

    if (s_rx_packet_list_head != NULL)
    {
        p = (nlradio_packet_t *)s_rx_packet_list_head;

        nrf_802154_critical_section_enter();

        s_rx_packet_list_head = (nlradio_packet_t *)(p->next);
        if (s_rx_packet_list_head == NULL)
        {
            s_rx_packet_list_tail = NULL;
        }

        nrf_802154_critical_section_exit();

        p->next = NULL;
    }

    return p;
}

/**
 * Initialize the nlradio driver
 *
 * @note
 *    This function is called from nlradio_enable()
 *    and nlradio_disable().  In both cases nlradio
 *    state, nrf radio state, and the radio hardware
 *    state should be left in the same condition.
 *    That is radio reset with power on, channel 11,
 *    default tx power, auto ack enabled, and nrf
 *    radio driver state and hardware state should
 *    be sleep as defined by the radio state
 *    diagram in OT platform radio.h.
 */
static void nlradio_init_internal(void)
{
#ifdef BUILD_FEATURE_ANTENNA_DIVERSITY
    uint32_t count;

    for (count = 0; count < ANTENNA_MAX; count++)
    {
        s_antenna_stats.shifted_avg_ack_rssi[count] = NLRADIO_INVALID_RSSI_PRECISON_SHIFT;
    }
#endif

