nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot-v2.c
    // reset the radio
    nrf_radio_power_set(false);
    nrf_radio_power_set(true);

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    nlradio_set_channel_internal(11);
#else
    s_channel = 11;

    nrf_802154_channel_set(s_channel);

    nrf_802154_tx_power_set(s_default_tx_power);
#endif //BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM

    nrf_802154_auto_ack_set(true);

    nlradio_sleep_internal();

    nlradio_rx_packet_init();

    s_rx_callback = NULL;
    s_tx_complete_callback = NULL;
#ifdef BUILD_FEATURE_RADIO_HEADER_IE
    s_tx_start_callback = NULL;
#endif
    s_escan_callback = NULL;
}

/**
 * Sleep the nlradio driver
 *
 * @note
 *    This function stops all radio activity.
 *    It stops any ack timeout timer, disables
 *    the FEM, puts the nrf radio driver and hardware
 *    in sleep mode and then releases the nlplatform
 *    sleep lock.
 */
static void nlradio_sleep_internal(void)
{
    uint16_t msTick = NLRADIO_SLEEP_WAIT_MS;

    // Call sleep until we get success indicating that we are on the way to sleep
    while (!nrf_802154_sleep() && --msTick)
    {
        nlplatform_delay_ms(1);
    }

    // Wait for the state transition to actually happen indicating that the radio is asleep
    while ((nrf_802154_state_get() != NRF_802154_STATE_SLEEP) && msTick--)
    {
        nlplatform_delay_ms(1);
    }

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    nlproduct_FEM_disable();
#endif

#if defined(BUILD_FEATURE_NL_PROFILE)
    nl_profile_stop(NL_PROFILE_RADIO_ENABLED);
#endif
}

/**
 * Wake the nlradio driver
 *
 * @note
 *    This function prepares the radio for operation
 *    by acquiring the nlplatform sleep lock and
 *    enabling the FEM.
 */
static void nlradio_wakeup_internal(void)
{
#if defined(BUILD_FEATURE_NL_PROFILE)
    nl_profile_start(NL_PROFILE_RADIO_ENABLED);
#endif

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    nlproduct_FEM_enable();
#endif
}

/**
 * Convert format of short address
 *
 * @note
 *    This function converts a uint16_t src
 *    to a 2 byte uint8_t array with the lsb
 *    byte of the uint16_t stored in the first
 *    byte of the array and the msb of the uint16_t
 *    stored in the second byte of the array.
 *
 * @param[in]  src  a uint16_t byte short address
 * @param[out] dest a pointer to a 2 byte Uint8_t array
 *
 */
static inline void nlradio_convert_short_address(uint8_t *dest, uint16_t src)
{
    dest[0] = (uint8_t) src;
    dest[1] = (uint8_t)(src >> 8);
}

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
/**
 * lookup tx power settings in flash and configure radio power register
 */
static void nlradio_set_transmit_power(void)
{
    nlencoded_transmit_power_t power;
    int8_t radio_tx_power;

    if (nlproduct_lookup_transmit_power(s_channel, s_target_txpower, s_backoff_txpower, &power) >= 0)
    {
        s_txpower_settings = power;
    }
    else
    {
        s_txpower_settings = INVALID_ENCODED_TXPOWER;
    }

    // when there is a FEM, the power value shouldn't be used directly
    // but must be parsed by the product FEM library, which will
    // return to us the TXPOWER register setting to use and also
    // configure the FEM accordingly when the TX is enabled next.
    // This API always returns a valid tx power radio register settings.
    radio_tx_power = nlproduct_FEM_configure_transmit_power(s_txpower_settings);

    nrf_802154_tx_power_set(radio_tx_power);
}

/**
 * Channel change API
 * @param[in] channel number
 */
static void nlradio_set_channel_internal(uint8_t channel)
{
    assert((channel >= 11) && (channel <= 26));
    s_channel = channel;
    nrf_802154_channel_set(channel);
    nlradio_set_transmit_power();
}

#else //!BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM

/**
 * Set the tx power
 *
 * @param[in] TX power register value
 *
 */
static void nlradio_set_tx_power_internal(int8_t power)
{
    nrf_802154_tx_power_set(power);
}

#endif// BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM

#ifdef BUILD_FEATURE_ANTENNA_DIVERSITY
/**
 * Internal API to calculate average ack RSSI for an antenna.
 * Called from tx compete ISR context.
 * @param[in] ack rssi.
 */
static void nlradio_update_avg_ack_rssi(int8_t rssi)
{
    int16_t new_rssi, old_average, new_average;
    antenna_e cur_antenna = nlproduct_get_current_antenna();

    nlREQUIRE(rssi != NLRADIO_INVALID_RSSI, done);

    assert(cur_antenna < ANTENNA_MAX);

    // Multiply the RSS value by a precision multiple (currently 8)
    new_rssi = rssi << NLRADIO_RSSI_PRECISON_SHIFT;

    // Get a snapshot of the current avg.
    old_average = s_antenna_stats.shifted_avg_ack_rssi[cur_antenna];

    if (NLRADIO_INVALID_RSSI_PRECISON_SHIFT == old_average)
    {
        // first time
        new_average = new_rssi;
    }
    else
    {
        // Maintain an exponentially weighted moving average using coefficient of (1/2^NLRADIO_RSSI_COEFF_SHIFT)
        // new_average = new_rssi * 1/2^j + old_average * (1 - 1/2^j), for j = NLRADIO_RSSI_COEFF_SHIFT
        new_average = (int16_t)(((old_average << NLRADIO_RSSI_COEFF_SHIFT) - old_average + new_rssi) >> NLRADIO_RSSI_COEFF_SHIFT);
    }

    // store the shifted rssi for future calculation
    s_antenna_stats.shifted_avg_ack_rssi[cur_antenna] = new_average;

done:
    return;
}

/**
 * Internal API to calculate the actual 8bit avg ack rssi from a precision shifted rssi value
 * @param[in] precicion shifted rssi value
 *
 * @retval rssi in 8bit format
 */
static int8_t nlradio_get_avg_ack_rssi(int16_t shifted_rssi)
{
    int8_t rssi = NLRADIO_INVALID_RSSI;

    nlREQUIRE(shifted_rssi != NLRADIO_INVALID_RSSI_PRECISON_SHIFT, done);

    rssi = (int8_t)(shifted_rssi >> NLRADIO_RSSI_PRECISON_SHIFT);

    // Check for possible round up (e.g., average of -71.5 --> -72)
    if ((shifted_rssi & NLRADIO_RSSI_PRECISON_MASK) >= (NLRADIO_PRECISON >> 1))
    {
        rssi--;
    }

done:
    return rssi;
}
#endif // BUILD_FEATURE_ANTENNA_DIVERSITY

/**
 * API to get the wpan antenna stats.
 * @param[in] pointer to a location to hold the stats counter.
 *
 * @retval k_nlradio_error_none   If antenna diversity is supported for the product
 * @retval k_nlradio_error_fail   If antenna diversity is not supported for the product
 */
int nlradio_get_wpan_antenna_stats(nlradio_wpan_antenna_stats_t *wpan_antenna_stats)
{
#ifdef BUILD_FEATURE_ANTENNA_DIVERSITY
    uint32_t count;

    assert(NULL != wpan_antenna_stats);

    for (count = 0 ; count < ANTENNA_MAX; count++)
    {
        wpan_antenna_stats->antenna_stats[count].tx_success_cnt = s_antenna_stats.antenna_stats[count].tx_success_cnt;
        wpan_antenna_stats->antenna_stats[count].tx_fail_cnt    = s_antenna_stats.antenna_stats[count].tx_fail_cnt;
        wpan_antenna_stats->antenna_stats[count].avg_ack_rssi   = nlradio_get_avg_ack_rssi(s_antenna_stats.shifted_avg_ack_rssi[count]);
    }

    wpan_antenna_stats->ant_switch_cnt = s_antenna_stats.ant_switch_cnt;

    return k_nlradio_error_none;
#else
    (void)wpan_antenna_stats;

    return k_nlradio_error_fail;
#endif
}

/**
 * Called when TX is complete with success or failure
 * @param[in]  nlradio_tx_error_t  TX success or failure
 *
 */
static void nlradio_tx_done(nlradio_tx_error_t tx_error)
{
#ifdef BUILD_FEATURE_ANTENNA_DIVERSITY
    if (!s_prevent_antenna_switch)
    {
        antenna_e cur_antenna = nlproduct_get_current_antenna();
        volatile nlradio_per_ant_stats_internal_t *cur_antenna_stats;

        assert(cur_antenna < ANTENNA_MAX);

        cur_antenna_stats = &s_antenna_stats.antenna_stats[cur_antenna];

        // Antenna switch logic
        if (tx_error == k_nlradio_tx_error_no_ack)
        {
            // Set bit in case of error over the air
            s_tx_failure_ota |= (1UL << s_tx_failure_ota_index);

            cur_antenna_stats->tx_fail_cnt++;
        }
        else if (tx_error == k_nlradio_tx_error_none)
        {
            // Clear bit in case of tx success
            s_tx_failure_ota &= ~(1UL << s_tx_failure_ota_index);

            cur_antenna_stats->tx_success_cnt++;
        }

