nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot-v2.c
        s_tx_failure_ota_index++;

        // Reset index when we reach the max number of bytes.
        // Start filling out from the beginning without erasing the rest
        // of the bytes to keep history.
        if (s_tx_failure_ota_index == NL_RADIO_NUM_BITS)
        {
            s_tx_failure_ota_index = 0;
        }

        // If we see more than 50% of the transmits fail, then switch antenna
        if (__builtin_popcount(s_tx_failure_ota) > NL_RADIO_FAILURE_THRESH)
        {
            // Switch antenna
            nlproduct_select_next_antenna();

            s_antenna_stats.ant_switch_cnt++;

            s_tx_failure_ota = 0;
            s_tx_failure_ota_index = 0;
        }
    }
#endif // BUILD_FEATURE_ANTENNA_DIVERSITY
}

/**
 * Mechanism to prevent/allow antenna switching
 *
 * @param[in]  prevent_switching     Indicates whether antenna switching should be on or off
 *
 */
#ifdef BUILD_FEATURE_ANTENNA_DIVERSITY
void nlradio_set_prevent_antenna_switch(bool prevent_switching)
{
    if (prevent_switching)
    {
        s_tx_failure_ota = 0;
        s_tx_failure_ota_index = 0;
    }

    s_prevent_antenna_switch = prevent_switching;
}
#endif // BUILD_FEATURE_ANTENNA_DIVERSITY

/**
 * Get the nest factory-assigned IEEE EUI-64 for this interface.
 *
 * @param[out] eui64_addr  A pointer to where the nest factory-assigned IEEE EUI-64 will be placed.
 *
 * @retval true   If the Extended Address get operation succeeded.
 * @retval false  If the Extended Address get operation failed.
 */
static bool nlradio_get_nest_ieee_eui64(uint8_t *eui64_addr)
{
    bool retval = false;
    char value[24]; // "xx:xx:xx:xx:xx:xx:xx:xx";
    size_t value_length = sizeof(value) / sizeof(value[0]);

    nlREQUIRE(nl_sysenv_get_string(k802154AddrKey, value, value_length) >= 0, done);

    nlREQUIRE(nl_getCharSeparatedBytes(value, eui64_addr, EXTENDED_ADDRESS_SIZE, ':', 16) == EXTENDED_ADDRESS_SIZE, done);

    retval = true;

done:
    return retval;
}

/**
 ****************
 * NL Radio API *
 ****************
 */

/**
 * Intialize the radio.
 *
 * @param[in] inContext           A pointer to a nlradio specific context
 *                                provided by nlradio client.
 *
 * @retval k_nlradio_error_none   If radio driver initialization succeeded.
 * @retval k_nlradio_error_fail   If radio driver initialization failed.
 */
int nlradio_init(void *inContext)
{
    check_single_task();

    nrf_802154_init();

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    // default value set in nlproduct_config.h
    s_target_txpower = NLRADIO_DEFAULT_ACK_TX_POWER;
#else
    s_default_tx_power = NLRADIO_MAX_RADIO_TX_POWER;
#endif  // BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM

    return k_nlradio_error_none;
}

/**
 * Initialize and enable the radio, then transition to sleep state.
 *
 * @retval k_nlradio_error_none   If radio driver transitioned to sleep.
 * @retval k_nlradio_error_fail   If radio driver initialization failed.
 */
int nlradio_enable(void)
{
    int retval = k_nlradio_error_fail;

    check_single_task();

    if (s_radio_state == k_nlradio_state_disabled)
    {
        nlradio_init_internal();

        s_radio_state = k_nlradio_state_sleep;

        retval = k_nlradio_error_none;
    }

    return retval;
}

/**
 * Disable radio and transition to disabled.
 *
 * @retval k_nlradio_error_none   If transitioned to disabled state.
 * @retval k_nlradio_error_fail   If failed to disable radio.
 */
int nlradio_disable(void)
{
    int retval = k_nlradio_error_fail;

    check_single_task();

    if (s_radio_state == k_nlradio_state_sleep)
    {
        nlradio_init_internal();

        s_radio_state = k_nlradio_state_disabled;

        retval = k_nlradio_error_none;
    }

    return retval;
}

/**
 * Get the current state of the radio driver.
 *
 * @retval The current radio driver state, one of nlradio_state_t.
 */
nlradio_state_t nlradio_get_state(void)
{
    check_single_task();

    return s_radio_state;
}

/**
 * Set the PAN ID for address filtering.
 *
 * @param[in] pan_id  The IEEE 802.15.4 PAN ID.
 *
 * @retval k_nlradio_error_none  If the PAN ID set operation succeeded.
 * @retval k_nlradio_error_fail  If the PAN ID set operation failed.
 */
int nlradio_set_pan_id(uint16_t pan_id)
{
    receive_complete_cb callback;
    uint8_t id[PAN_ID_SIZE];

    check_single_task();

    nlradio_convert_short_address(id, pan_id);

    // setting the current callback to NULL
    // to ignore Rx packets until new pan id is set
    callback = s_rx_callback;
    s_rx_callback = NULL;

    nrf_802154_pan_id_set(id);

    // restore the rx callback
    s_rx_callback = callback;

    return k_nlradio_error_none;
}

/**
 * Set the default TX power, used for ACK.
 *
 * @param[in] aPower The TX power to use in dBm
 *
 * @retval k_nlradio_error_none  If the default TX power set operation succeeded.
 * @retval k_nlradio_error_fail  If the default TX power set operation failed.
 */
int nlradio_set_tx_power(int8_t aPower)
{
#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    //TODO: This API needs to be removed as soon as nlopenthread starts using the new target tx power API.
    (void)aPower;
#else
    check_single_task();

    s_default_tx_power = aPower;

    nlradio_set_tx_power_internal(s_default_tx_power);
#endif

    return k_nlradio_error_none;
}

/**
 * Set the target TX power to be used for packet transmission & acks
 *
 * @param[in] aPower The target TX power to use in units of 0.01 dBm
 *
 * @retval k_nlradio_error_none  If the default TX power set operation succeeded.
 * @retval k_nlradio_error_fail  If the default TX power set operation failed.
 */
int nlradio_set_target_txpower(int aPower)
{
#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    if (aPower == s_target_txpower)
    {
        return k_nlradio_error_none;
    }

    check_single_task();

    s_target_txpower = aPower;

    nlradio_set_transmit_power();
#else
    (void)aPower;
#endif

    return k_nlradio_error_none;
}

/**
 * Set the tx power backoff
 *
 * @param[in] backoff value in units of 0.01 dBm.
 *
 * @retval k_nlradio_error_none  If the power backoff set operation succeeded.
 * @retval k_nlradio_error_fail  If the power backoff set operation failed.
 */
int nlradio_set_txpower_backoff(int aBackoff)
{
#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
    if (aBackoff == s_backoff_txpower)
    {
        return k_nlradio_error_none;
    }

