nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot-v2.c
    check_single_task();

    s_backoff_txpower = aBackoff;

    nlradio_set_transmit_power();
#else
    (void)aBackoff;
#endif

    return k_nlradio_error_none;
}

/**
 * Set the Extended Address for address filtering.
 *
 * @param[in] extended_address  A pointer of 8 bytes containing the IEEE 802.15.4 Extended Address.
 *
 * @retval k_nlradio_error_none  If the Extended Address set operation succeeded.
 * @retval k_nlradio_error_fail  If the Extended Address set operation failed.
 */
int nlradio_set_extended_address(const uint8_t *extended_address)
{
    receive_complete_cb callback;

    check_single_task();

    // setting the current callback to NULL
    // to ignore Rx packets until new extended address is set
    callback = s_rx_callback;
    s_rx_callback = NULL;

    nrf_802154_extended_address_set(extended_address);

    // restore the rx callback
    s_rx_callback = callback;

    return k_nlradio_error_none;
}

/**
 * Set the Short Address for address filtering.
 *
 * @param[in] short_address  The IEEE 802.15.4 Short Address.
 *
 * @retval k_nlradio_error_none  If the Short Address set operation succeeded.
 * @retval k_nlradio_error_fail  If the Short Address set operation failed.
 */
int nlradio_set_short_address(uint16_t short_address)
{
    receive_complete_cb callback;
    uint8_t address[SHORT_ADDRESS_SIZE];

    check_single_task();

    nlradio_convert_short_address(address, short_address);

    // setting the current callback to NULL
    // to ignore Rx packets until new short address is set
    callback = s_rx_callback;
    s_rx_callback = NULL;

    nrf_802154_short_address_set(address);

    // restore the rx callback
    s_rx_callback = callback;

    return k_nlradio_error_none;
}

/**
 * Put the radio to sleep and the driver into the sleep state.
 *
 * @retval k_nlradio_error_none  If the radio was successfully put in sleep mode.
 * @retval k_nlradio_error_fail  If the function failed.
 */
int nlradio_sleep(void)
{
    int retval;

    check_single_task();

    switch (s_radio_state)
    {
        case k_nlradio_state_receive:
            s_rx_callback = NULL;
            nlradio_sleep_internal();
            nlradio_rx_packet_init();
            // intentional fall-thru
        case k_nlradio_state_disabled:
            s_radio_state = k_nlradio_state_sleep;
            // intentional fall-thru
        case k_nlradio_state_sleep:
            retval = k_nlradio_error_none;
            break;
        case k_nlradio_state_energy_scan:
        default:
            retval = k_nlradio_error_fail;
            break;
    }

    return retval;
}

/**
 * Transmit the provided buffer on the specified channel.
 *
 * @note
 *    Upon return from this function the buffer can be recycled.
 *    A successful return indicates that the radio driver has transitioned
 *    into the k_nlradio_state_transmit state. The radio will remain in this state
 *    until the transmit operation completes upon which it will execute the optional
 *    callback (tx_complete_cb) if provided.
 *    Both tx_complete_cb and tx_start_cb are executed by the ISR and must therefore be
 *    ISR safe.
 *
 * @param[in] buffer          A buffer containing length bytes for transmission.
 * @param[in] length          The number of bytes in buffer to transmit.
 * @param[in] channel         The radio channel upon which the transmission shall occur.
 * @param[in] power           The transmit power for transmission (dBm).
 * @param[in] tx_complete_cb  An optional callback that will be called when the transmit completes. Can be NULL.
 * @param[in] tx_start_cb     An optional callback that will be called when the transmit starts. Can be NULL.
 *
 * @retval k_nlradio_error_none  If the transmission was started successfully and the radio transitioned to the k_nlradio_state_transmit.
 * @retval k_nlradio_error_fail  If the transmission failed to start.
 */
#ifdef BUILD_FEATURE_RADIO_HEADER_IE
int nlradio_transmit(nlradio_tx_params_t *radio_tx_params, transmit_complete_cb tx_complete_cb, transmit_start_cb tx_start_cb)
#else
int nlradio_transmit(nlradio_tx_params_t *radio_tx_params, transmit_complete_cb tx_complete_cb)
#endif
{
    int retval = k_nlradio_error_fail;

    check_single_task();

    if (s_radio_state == k_nlradio_state_receive)
    {
        // copy the tx packet information into the local tx packet structure
        s_tx_packet.length = radio_tx_params->length;
        memcpy(s_tx_packet.psdu, radio_tx_params->buffer, radio_tx_params->length);

        // store the optional caller supplied transmit callback for use in handle_transmit_isr().
        s_tx_complete_callback = tx_complete_cb;
#ifdef BUILD_FEATURE_RADIO_HEADER_IE
        s_tx_start_callback = tx_start_cb;
#endif

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
        if (radio_tx_params->channel != s_channel)
        {
            nlradio_set_channel_internal(radio_tx_params->channel);
        }
#else
        s_channel = radio_tx_params->channel;

        nrf_802154_channel_set(s_channel);

        nlradio_set_tx_power_internal(radio_tx_params->power);
#endif //BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM

        // change the radio state to indicate that it is now in the transmit state.
        s_radio_state = k_nlradio_state_transmit;

        if (radio_tx_params->is_cca_enabled)
        {
            nrf_802154_transmit_csma_ca_raw(&s_tx_packet.length);

            retval = k_nlradio_error_none; // indicate success to the caller.
        }
        else
        {
            uint16_t msTick = NLRADIO_TX_WAIT_MS;

            while (!nrf_802154_transmit_raw(&s_tx_packet.length, radio_tx_params->is_cca_enabled) && --msTick)
            {
                nlplatform_delay_ms(1);
            }

            if (msTick)
            {
                retval = k_nlradio_error_none; // indicate success to the caller.
            }
        }
    }

    return retval;
}

/**
 * Transition the radio to receive and execute the callback when complete.
 *
 * @note
 *    A successful return indicates that the radio driver has transitioned
 *    into the k_nlradio_state_receive state. The radio will remain in this state
 *    until the receive operation completes upon which it will execute the callback
 *    (cb).  The callback is executed by the ISR and must therefore be
 *    ISR safe.
 *
 * @param[in] channel       The radio channel upon which the receive operation shall occur.
 * @param[in] cb            A callback that will be called when the receive completes.
 *
 * @retval k_nlradio_error_none  If the reception was started successfully and the radio transitioned to the k_nlradio_state_receive.
 * @retval k_nlradio_error_fail  If the reception failed to start.
 */
int nlradio_receive(uint8_t channel, receive_complete_cb cb)
{
    int retval = k_nlradio_error_fail;

