nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot-v2.c
    check_single_task();

    if (s_radio_state == k_nlradio_state_sleep || // configure the radio for receive.
        (s_radio_state == k_nlradio_state_receive && (channel != s_channel || cb != s_rx_callback))) // change the receive channel or callback
    {
        if (s_radio_state == k_nlradio_state_sleep)
        {
            nlradio_wakeup_internal();
        }

        // setting the current callback to NULL
        // to ignore Rx packets
        s_rx_callback = NULL;

        // change the radio state to indicate that it is now in the receive state.
        s_radio_state = k_nlradio_state_receive;

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
        nlradio_set_channel_internal(channel);
#else
        s_channel = channel;

        nrf_802154_channel_set(s_channel);
        nlradio_set_tx_power_internal(s_default_tx_power);
#endif //BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM

        nrf_802154_receive();

        s_rx_callback = cb;

        retval = k_nlradio_error_none; // indicate success back to the caller.
    }
    else if (s_radio_state == k_nlradio_state_receive)
    {
        retval = k_nlradio_error_none; // indicate success back to the caller.
    }

    return retval;
}

/**
 * Read radio RSSI.
 *
 * @note
 *    RSSI should be read when there are no detectable ongoing
 *    15.4 packet transmissions.
 *
 * @param[out] rssi                A pointer to hold the RSSI value.
 *
 * @retval k_nlradio_error_none    Successfully read RSSI.
 * @retval k_nlradio_error_fail    Radio was busy, could not read RSSI.
 */
int nlradio_get_rssi(int8_t *rssi)
{
    check_single_task();

    *rssi = nrf_802154_rssi_last_get();

    return k_nlradio_error_none;
}

/**
 * Called to perform post-processing of a previously received frame.
 *
 * @note
 *    The caller is expected to call this API only after having been notified
 *    by execution of the receive_complete_cb that was passed into nlradio_receive().
 *
 * @param[out] buffer        A buffer pointer to hold the received frame on completion.
 * @param[out] num_bytes     The number of bytes used in buffer to store the RX frame.
 * @param[out] channel       The channel the radio was on when it received the frame.
 * @param[out] power         The signal strength (RSSI) of the received frame.
 * @param[out] lqi           The link quality indicator for the received frame.
 * @param[out] timestamp     The time since boot when the radio began to receive the frame (rx sfd), in microseconds.
 *
 * @retval k_nlradio_error_none  If the driver specific operation completed successfully.
 * @retval k_nlradio_error_fail  If the driver specific operation failed.
 */
#ifdef BUILD_FEATURE_RADIO_HEADER_IE
int nlradio_post_process_receive(uint8_t **buffer, uint32_t *num_bytes, uint8_t *channel, int8_t *power, uint8_t *lqi, uint64_t *timestamp)
#else
int nlradio_post_process_receive(uint8_t **buffer, uint32_t *num_bytes, uint8_t *channel, int8_t *power, uint8_t *lqi)
#endif
{
    int retval = k_nlradio_error_fail;
    nlradio_packet_t *p;

    check_single_task();

    if (buffer != NULL && num_bytes != NULL)
    {
        if ((p = nlradio_rx_packet_list_dequeue()) != NULL)
        {
            *buffer = p->psdu;
            *num_bytes = p->length;
            *channel = p->channel;
            *power = p->power;
            *lqi = p->lqi;
#ifdef BUILD_FEATURE_RADIO_HEADER_IE
            *timestamp = p->timestamp;
#endif

            retval = k_nlradio_error_none;
        }
    }

    return retval;
}

/**
 * Called to free a buffer received in nlradio_post_process_receive.
 *
 * @note
 *    The caller is expected to call this API when it is ready to free a buffer it
 *    acquired from nlradio_post_process_receive.
 *
 * @param[in] buffer        A buffer to be freed.
 *
 * @retval k_nlradio_error_none  If the driver specific operation completed successfully.
 * @retval k_nlradio_error_fail  If the driver specific operation failed.
 */
int nlradio_buffer_free(uint8_t *buffer)
{
    int retval = k_nlradio_rx_error_none;

    check_single_task();

    if (!nlradio_rx_packet_free(buffer))
    {
        retval = k_nlradio_error_fail;
    }

    return retval;
}

/**
 * Returns the capabilities of the radio.
 *
 * @retval A bitfield consisting of zero or more nlradio_capabilities_t values.
 */
nlradio_capabilities_t nlradio_get_capabilities(void)
{
    check_single_task();

    // use OT energy scan for now so don't include k_nlradio_capability_energy_scan
    return k_nlradio_capability_ack_timeout | k_nlradio_capability_csma_backoff;
}

/**
 * Override source address matching and set frame pending
 * for all short and extended address data polls.
 *
 * @param[in] enable    true, to set frame pending for all acks
 *                      false, to use the frame pending source address match tables
 *                             to determine whether to set frame pending in ack
 *
 * @retval k_nlradio_error_none  If the override source match operation succeeded.
 * @retval k_nlradio_error_fail  If the override source match operation failed.
 */
int nlradio_override_source_match(bool enable)
{
    check_single_task();

    nrf_802154_auto_pending_bit_set(enable);

    return k_nlradio_error_none;
}

/**
 * Clear all Extended Address source match entries.
 *
 * @retval k_nlradio_error_none  If the clear all extended address match operation succeeded.
 * @retval k_nlradio_error_fail  If the clear all extended address match operation failed.
 */
int nlradio_clear_extended_source_match_address_entries(void)
{
    const bool address_is_extended = true;

    check_single_task();

    nrf_802154_pending_bit_for_addr_reset(address_is_extended);

    return k_nlradio_error_none;
}

/**
 * Set/Clear the Extended Address source match entry.
 *
 * @param[in] extended_address  A pointer of 8 bytes containing the IEEE 802.15.4 Extended Address.
 * @param[in] pending           true, to add this extended address to the source match table,
 *                              false, to remove this extended address from the source match table
 *
 * @retval k_nlradio_error_none  If the set extended address match operation succeeded.
 * @retval k_nlradio_error_fail  If the address could not be added to the table when pending == true
 *                               or if the address was not found when pending == false
 */
int nlradio_set_extended_source_match_address_entry(const uint8_t *extended_address, bool pending)
{
    int retval = k_nlradio_error_fail;
    const bool address_is_extended = true;

