nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot-v2.c
    check_single_task();

    if (pending)
    {
        if (nrf_802154_pending_bit_for_addr_set(extended_address, address_is_extended))
        {
            retval = k_nlradio_error_none;
        }
    }
    else
    {
        if (nrf_802154_pending_bit_for_addr_clear(extended_address, address_is_extended))
        {
            retval = k_nlradio_error_none;
        }
    }

    return retval;
}

/**
 * Clear all Short Address source match entries.
 *
 * @retval k_nlradio_error_none  If the clear all short address match operation succeeded.
 * @retval k_nlradio_error_fail  If the clear all short address match operation failed.
 */
int nlradio_clear_short_source_match_address_entries(void)
{
    const bool address_is_extended = false;

    check_single_task();

    nrf_802154_pending_bit_for_addr_reset(address_is_extended);

    return k_nlradio_error_none;
}

/**
 * Set/Clear the Short Address source match entry.
 *
 * @param[in] short_address  The IEEE 802.15.4 Short Address.
 * @param[in] pending           true, to add this short address to the source match table,
 *                              false, to remove this short address from the source match table
 *
 * @retval k_nlradio_error_none  If the set short address match operation succeeded.
 * @retval k_nlradio_error_fail  If the address could not be added to the table when pending == true
 *                               or if the address was not found when pending == false
 */
int nlradio_set_short_source_match_address_entry(uint16_t short_address, bool pending)
{
    int retval = k_nlradio_error_fail;
    uint8_t address[SHORT_ADDRESS_SIZE];
    const bool address_is_extended = false;

    check_single_task();

    nlradio_convert_short_address(address, short_address);

    if (pending)
    {
        if (nrf_802154_pending_bit_for_addr_set(address, address_is_extended))
        {
            retval = k_nlradio_error_none;
        }
    }
    else
    {
        if (nrf_802154_pending_bit_for_addr_clear(address, address_is_extended))
        {
            retval = k_nlradio_error_none;
        }
    }

    return retval;
}

/**
 * Get the radio filter mode.
 *
 * @retval The current filter mode.
 */
nlradio_filter_mode_t nlradio_get_filter_mode(void)
{
    nlradio_filter_mode_t filter_mode = k_nlradio_filter_mode_normal;

    check_single_task();

    if (nrf_802154_promiscuous_get())
    {
        filter_mode = k_nlradio_filter_mode_full_promiscuous;
    }

    return filter_mode;
}

/**
 * Set the radio filter mode to either normal (destination address filtering),
 * promiscuous (all to a given panid), or monitor mode (all on given channel).
 *
 * @param[in] filter_mode       The radio filter mode.
 *
 * @retval k_nlradio_error_none  If the set filter mode operation succeeded.
 * @retval k_nlradio_error_fail  If the given filter mode could not be set.
 */
int nlradio_set_filter_mode(nlradio_filter_mode_t filter_mode)
{
    bool enable;

    check_single_task();

    switch(filter_mode)
    {
        case k_nlradio_filter_mode_network_promiscuous:
        case k_nlradio_filter_mode_full_promiscuous:
            enable = true;
            break;

        case k_nlradio_filter_mode_normal:
        default:
            enable = false;
            break;
    }

    nrf_802154_promiscuous_set(enable);

    return k_nlradio_error_none;
}

/**
 * Initiate an energy scan on the specified channel for the specified duration.
 *
 * @param[in] channel       The radio channel upon which the energy scan operation shall occur.
 * @param[in] duration_msec The duration in milliseconds for the energy scan.
 * @param[in] cb            A callback that will be called when the energy scan completes.
 *
 * @retval k_nlradio_error_none  If the start energy scan operation succeeded.
 * @retval k_nlradio_error_fail  If the start energy scan operation failed.
 */
int nlradio_start_energy_scan(uint8_t channel, uint32_t duration_msec, escan_complete_cb cb)
{
    int retval = k_nlradio_error_fail;

    check_single_task();

    if (s_radio_state == k_nlradio_state_sleep || s_radio_state == k_nlradio_state_receive)
    {
        uint16_t msTick = NLRADIO_ESCAN_WAIT_MS;

        if (s_radio_state == k_nlradio_state_sleep)
        {
            nlradio_wakeup_internal();
        }

        s_pre_escan_radio_state = s_radio_state;

        s_escan_callback = cb;

        s_radio_state = k_nlradio_state_energy_scan;

        nrf_802154_channel_set(channel);

        while (!nrf_802154_energy_detection(duration_msec) && --msTick)
        {
            nlplatform_delay_ms(1);
        }

        if (msTick)
        {
            retval = k_nlradio_error_none;
        }
        else
        {
            s_radio_state = s_pre_escan_radio_state;
        }
    }

    return retval;
}

/**
 * Get the factory-assigned IEEE EUI-64 for this interface.
 *
 * @param[in]  aInstance             The OpenThread instance structure.
 * @param[out] aIeeeEui64            A pointer to where the factory-assigned IEEE EUI-64 will be placed.
 *
 * @retval k_nlradio_error_none  If the Extended Address set operation succeeded.
 * @retval k_nlradio_error_fail  If the Extended Address set operation failed.
 */
int nlradio_get_ieee_eui64(uint8_t *aIeeeEui64)
{
    check_single_task();

    if (!nlradio_get_nest_ieee_eui64(aIeeeEui64))
    {
        uint64_t factoryAddress = (uint64_t)NRF_FICR->DEVICEID[0] << 32;

        factoryAddress |=  NRF_FICR->DEVICEID[1];

        memcpy(aIeeeEui64, &factoryAddress, sizeof(factoryAddress));
    }

    return k_nlradio_error_none;
}

/**
 * Get radio receive sensitivity.
 *
 * @retval The radio receive sensitivity value in dBm.
 */
int nlradio_get_rx_sensitivity(void)
{
    check_single_task();

    return NLRADIO_RECEIVE_SENSITIVITY;
}


/**
 ***************************************************
 * Nordic Radio Driver ISR Handler function calls. *
 ***************************************************
 */

/**
 * Notify that frame was received.
 *
 * @note Buffer pointed by the p_data pointer is not modified by the radio driver (and can't
 *       be used to receive a frame) until nrf_802154_buffer_free_raw() function is called.
 * @note Buffer pointed by the p_data pointer may be modified by the function handler (and other
 *       modules) until nrf_802154_buffer_free_raw() function is called.
 *
 * p_data
 * v
 * +-----+-----------------------------------------------------------+------------+
 * | PHR | MAC Header and payload                                    | FCS        |
 * +-----+-----------------------------------------------------------+------------+
 *       |                                                                        |
 *       | <---------------------------- PHR -----------------------------------> |
 *
 * @param[in]  p_data  Pointer to the buffer containing received data (PHR + PSDU). First byte in
 *                     the buffer is length of the frame (PHR) and following bytes is the frame
 *                     itself (PSDU). Length byte (PHR) includes FCS. FCS is already verified by
 *                     the hardware and may be modified by the hardware.
 * @param[in]  power   RSSI of received frame.
 * @param[in]  lqi     LQI of received frame.
 */
void nrf_802154_received_raw(uint8_t *p_data, int8_t power, uint8_t lqi)
{
    if (s_radio_state == k_nlradio_state_receive || s_radio_state == k_nlradio_state_transmit)
    {
        if (s_rx_callback != NULL)
        {
            nlradio_rx_error_t rx_error = k_nlradio_rx_error_no_buffer;
            bool all_buffers_used;
            nlradio_packet_t *p;
            const bool from_isr = true;

            if ((p = nlradio_rx_packet_alloc_isr(&all_buffers_used)) != NULL)
            {
                if (all_buffers_used)
                {
                    /* If there is no more rx buffer in the pool, disable the
                     * auto-ack so that radio does not ack any future
                     * received frame.
                     */

                    nrf_802154_auto_ack_set(false);
                }

                rx_error = k_nlradio_rx_error_none;

                p->length = p_data[0];
                p->power = power;
                p->lqi = lqi;
                memcpy(p->psdu, &p_data[1], p->length);
                p->channel = nrf_802154_channel_get();
#ifdef BUILD_FEATURE_RADIO_HEADER_IE
                uint64_t ota_time = (PHR_SIZE + p->length) * PHY_SYMBOLS_PER_OCTET * PHY_US_PER_SYMBOL;
                p->timestamp = nltime_get_system_us() - ota_time;
#endif

                nlradio_rx_packet_list_enqueue_isr(p);
            }

            s_rx_callback(rx_error, from_isr);
        }
    }

    if (s_in_radio_isr)
    {
        nrf_802154_buffer_free_raw(p_data);
    }
    else
    {
        nrf_802154_core_notify_buffer_free(p_data);
    }
}

/**
 * Notify that reception of a frame failed.
 *
 * @param[in]  error  An error code that indicates reason of the failure.
 */
void nrf_802154_receive_failed(nrf_802154_rx_error_t error)
{
    switch (error)
    {
        case NRF_802154_RX_ERROR_INVALID_FRAME:
        case NRF_802154_RX_ERROR_INVALID_FCS:
        case NRF_802154_RX_ERROR_INVALID_DEST_ADDR:
        case NRF_802154_RX_ERROR_RUNTIME:
        case NRF_802154_RX_ERROR_TIMESLOT_ENDED:
        default:
            // TBD - determine which of these errors should be reported to nlopenthread
            // s_rx_callback(k_nlradio_rx_error_cancelled, true);
            break;
    }
}

/**
 * Notify that frame was transmitted.
 *
 * @note If ACK was requested for transmitted frame this function is called after proper ACK is
 *       received. If ACK was not requested this function is called just after transmission is
 *       ended.
 * @note Buffer pointed by the p_ack pointer is not modified by the radio driver (and can't
 *       be used to receive a frame) until nrf_802154_buffer_free_raw() function is
 *       called.
 * @note Buffer pointed by the p_ack pointer may be modified by the function handler (and other
 *       modules) until nrf_802154_buffer_free_raw() function is called.
 *
 * @param[in]  p_frame  Pointer to buffer containing PHR and PSDU of transmitted frame.
 * @param[in]  p_ack    Pointer to received ACK buffer. Fist byte in the buffer is length of the
 *                      frame (PHR) and following bytes are the ACK frame itself (PSDU). Length byte
 *                      (PHR) includes FCS. FCS is already verified by the hardware and may be
 *                      modified by the hardware.
 *                      If ACK was not requested p_ack is set to NULL.
 * @param[in]  power    RSSI of received frame or 0 if ACK was not requested.
 * @param[in]  lqi      LQI of received frame or 0 if ACK was not requested.
 */
void nrf_802154_transmitted_raw(const uint8_t *p_frame, uint8_t *p_ack, int8_t power, uint8_t lqi)
{
    transmit_complete_cb callback;

    // return the radio state back to receive
    s_radio_state = k_nlradio_state_receive;

#ifndef BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM
    // return the radio tx power to the default tx power used for acks
    nlradio_set_tx_power_internal(s_default_tx_power);
#endif //!BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM

    callback = s_tx_complete_callback;
    s_tx_complete_callback = NULL;

    if (callback)
    {
        bool frame_pending;
        const bool from_isr = true;

