nestlabs/nlplatform-nrf52x/src/nlradio-nrf52x-ot-v2.c
        if (p_ack == NULL)
        {
            frame_pending = false;
        }
        else
        {
            frame_pending = (p_ack[FRAME_PENDING_OFFSET] & FRAME_PENDING_BIT) ? true : false;
        }

        nlradio_tx_done(k_nlradio_tx_error_none);

#ifdef BUILD_FEATURE_ANTENNA_DIVERSITY
        nlradio_update_avg_ack_rssi(power);
#endif

        callback(k_nlradio_tx_error_none, frame_pending, power, lqi, from_isr);
    }

    if (p_ack != NULL)
    {
        nrf_802154_buffer_free_raw(p_ack);
    }

    (void)p_frame;
}

/**
 * Notify that frame was not transmitted due to busy channel.
 *
 * This function is called if transmission procedure fails.
 *
 * @param[in]  p_frame  Pointer to buffer containing PSDU of frame that was not transmitted.
 * @param[in]  error    Reason of the failure.
 */
void nrf_802154_transmit_failed(const uint8_t *p_frame, nrf_802154_tx_error_t error)
{
    transmit_complete_cb callback;

    // return the radio state back to receive
    s_radio_state = k_nlradio_state_receive;

#ifndef BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM
    // return the radio tx power to the default tx power used for acks
    nlradio_set_tx_power_internal(s_default_tx_power);
#endif //!BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM

    callback = s_tx_complete_callback;
    s_tx_complete_callback = NULL;

    if (callback)
    {
        nlradio_tx_error_t tx_error;
        const bool frame_pending = false;
        const bool from_isr = true;

        switch (error)
        {
            case NRF_802154_TX_ERROR_BUSY_CHANNEL:
            case NRF_802154_TX_ERROR_TIMESLOT_ENDED:
                tx_error = k_nlradio_tx_error_channel_busy;
                break;

            case NRF_802154_TX_ERROR_INVALID_ACK:
                tx_error = k_nlradio_tx_error_no_ack;
                break;

            case NRF_802154_TX_ERROR_NO_ACK:
                tx_error = k_nlradio_tx_error_no_ack;
                break;

            case NRF_802154_TX_ERROR_NO_MEM:
            default:
                tx_error = k_nlradio_tx_error_platform;
                break;
        }

        nlradio_tx_done(tx_error);
        callback(tx_error, frame_pending, kRadioRssiUnknown, 0, from_isr);
    }

    (void)p_frame;
}

/**
 * Notify that Energy Detection procedure finished.
 *
 * @note This function passes EnergyLevel defined in 802.15.4-2006 specification:
 *       0x00 - 0xff proportional to detected energy level (dBm above receiver sensitivity). To
 *       calculate result in dBm use nrf_802154_dbm_from_energy_level_calculate().
 *
 * @param[in]  result  Maximum energy detected during Energy Detection procedure.
 */
void nrf_802154_energy_detected(uint8_t result)
{
    if (s_radio_state == k_nlradio_state_energy_scan)
    {
        if (s_pre_escan_radio_state == k_nlradio_state_receive)
        {
            receive_complete_cb cb = s_rx_callback;

            s_rx_callback = NULL;

            s_radio_state = k_nlradio_state_receive;

            nrf_802154_channel_set(s_channel);

#if defined(BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM)
            nlradio_set_transmit_power();
#else
            nlradio_set_tx_power_internal(s_default_tx_power);
#endif  //BUILD_FEATURE_PRODUCT_HAS_RADIO_FEM

            nrf_802154_receive();

            s_rx_callback = cb;
        }
        else
        {
            nlradio_sleep_internal();

            s_radio_state = k_nlradio_state_sleep;
        }

        if (s_escan_callback)
        {
            const bool from_isr = true;

            s_escan_callback(nrf_802154_dbm_from_energy_level_calculate(result), from_isr);
        }
    }
}

#ifdef BUILD_FEATURE_RADIO_HEADER_IE
/**
 * @brief Notify that transmitting a frame has started.
 *
 * @note Usually, @ref nrf_802154_transmitted is called shortly after this function.
 *       However, if the transmit procedure is interrupted, it might happen that
 *       @ref nrf_802154_transmitted is not called.
 * @note This function should be very short to prevent dropping frames by the driver.
 *
 * @param[in]  p_frame  Pointer to the buffer containing PSDU of the frame being transmitted.
 */
void nrf_802154_tx_started(const uint8_t *aFrame)
{
    if (s_tx_start_callback)
    {
        const bool from_isr = true;

        s_tx_start_callback(s_tx_packet.psdu, from_isr);
        s_tx_start_callback = NULL;
    }
}
#endif

/**
 * Radio ISR
 *
 * Prototype is included here because this is an ISR handler and there is a symbol replacement
 * done by the linker (Radio_IRQHandler= nlradio_isr) so the prototype for nlradio_isr does not
 * exist elsewhere. The compiler will warn of a missing prototype otherwise which will be
 * interpreted as an error for our builds.
 */
void nlradio_isr(void);
void nlradio_isr(void)
{
    s_in_radio_isr = true;
    nrf_802154_radio_irq_handler();
    s_in_radio_isr = false;
}

